open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_aud_validation.c
/****************************************************************************
 * chips/bk7258/ap/bk7258_aud_validation.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Bounded real-board validation for the public BK7258 speaker audio ABI.
 ****************************************************************************/

#include <nuttx/config.h>

#ifdef CONFIG_BK7258_AUD_LIFECYCLE_VALIDATION

#include <errno.h>
#include <fcntl.h>
#include <inttypes.h>
#include <mqueue.h>
#include <sched.h>
#include <stdbool.h>
#include <stdint.h>
#include <string.h>
#include <sys/ioctl.h>
#include <syslog.h>
#include <time.h>
#include <unistd.h>

#include <nuttx/audio/audio.h>
#include <nuttx/clock.h>
#include <nuttx/kthread.h>

#include <arch/chip/bk7258_aud.h>

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define BDACVAL_DEVPATH \
  "/dev/audio/" CONFIG_BK7258_AUD_DEVNAME
#define BDACVAL_MQNAME               "bdacval"
#define BDACVAL_CYCLES               2u
#define BDACVAL_BUFFERS              CONFIG_BK7258_AUD_QUEUE_DEPTH
#define BDACVAL_TARGET_DEQUEUES      24u
#define BDACVAL_START_DELAY_US       1000000u
#define BDACVAL_TIMEOUT_SEC          8
#define BDACVAL_STACKSIZE            6144
#define BDACVAL_TONE_HZ              1000u
#define BDACVAL_TONE_AMPLITUDE       4096

#define BDACVAL_MAGIC                0x56434442u /* "BDCV" */
#ifdef CONFIG_BK7258_AUD_DAC_EQ
#  define BDACVAL_VERSION            6u
#  define BDACVAL_EQ_REJECTS_PER_CYCLE 8u
#  define BDACVAL_EQ_CONFIGS_PER_CYCLE 2u
#  define BDACVAL_EQ_READBACKS_PER_CYCLE 2u
#else
#  define BDACVAL_VERSION            5u
#endif
#define BDACVAL_RUNNING              1u
#define BDACVAL_PASSED               2u
#define BDACVAL_FAILED               3u
#define BDACVAL_IDLE_CPU_HZ           120000000u
#define BDACVAL_ACTIVE_CPU_HZ         480000000u

/****************************************************************************
 * Private Types
 ****************************************************************************/

enum bdacval_stage_e
{
  BDACVAL_STAGE_INIT = 1,
  BDACVAL_STAGE_OPEN,
  BDACVAL_STAGE_CAPS,
  BDACVAL_STAGE_RESERVE,
#ifdef CONFIG_BK7258_AUD_DAC_EQ
  BDACVAL_STAGE_EQ_CONFIG,
#endif
  BDACVAL_STAGE_CONFIGURE,
  BDACVAL_STAGE_BUFFER_INFO,
  BDACVAL_STAGE_MESSAGE_QUEUE,
  BDACVAL_STAGE_ALLOCATE,
  BDACVAL_STAGE_PRIME,
  BDACVAL_STAGE_START,
  BDACVAL_STAGE_RECEIVE,
  BDACVAL_STAGE_STOP,
  BDACVAL_STAGE_DRAIN,
  BDACVAL_STAGE_RELEASE,
  BDACVAL_STAGE_DIAGNOSTIC
};

struct bdacval_diag_s
{
  uint32_t magic;
  uint32_t version;
  uint32_t size;
  uint32_t state;
  int32_t  result;
  uint32_t stage;
  uint32_t cycles;
  uint32_t dequeues;
  uint32_t completes;
  uint32_t submitted_buffers;
  uint32_t final_buffers;
  uint32_t manual_stop_cycles;
  uint32_t natural_drain_cycles;
  uint32_t driver_state;
  int32_t  driver_first_error;
  uint32_t driver_resources;
  uint32_t driver_enqueue_delta;
  uint32_t driver_dequeue_delta;
  uint32_t driver_complete_delta;
  uint32_t driver_submitted_delta;
  uint32_t driver_played_delta;
  uint32_t driver_dma_alloc_delta;
  uint32_t driver_dma_start_delta;
  uint32_t driver_dma_isr_delta;
  uint32_t driver_final_drain_delta;
  uint32_t driver_dma_stop_delta;
  uint32_t driver_dma_deinit_delta;
  uint32_t driver_dma_free_delta;
  uint32_t driver_dac_start_delta;
  uint32_t driver_dac_stop_delta;
  uint32_t driver_pa_on_delta;
  uint32_t driver_pa_off_delta;
  uint32_t driver_underrun_delta;
  uint32_t driver_pa_enabled;
  uint32_t producer_priority;
  uint32_t producer_cpu_mask;
  uint32_t mq_depth_after_receive_max;
  uint32_t tick_frequency;
  uint32_t tick_regression_count;
  uint32_t monotonic_regression_count;
  uint32_t monotonic_sample_errors;

  /* START call duration, then the post-START wait until the producer has
   * actually received its first DEQUEUE message.
   */

  uint32_t cycle_ticks[BDACVAL_CYCLES];
  uint32_t start_ioctl_ticks[BDACVAL_CYCLES];
  uint32_t first_dequeue_delay_ticks[BDACVAL_CYCLES];
  uint32_t dequeue_interval_max_ticks;
  uint32_t received_dequeue_to_enqueue_max_ticks;
  uint32_t driver_perf_before_frequency;
  uint32_t driver_perf_frequency;
  uint32_t driver_frequency_vote_delta;
  uint32_t driver_frequency_release_delta;
  uint32_t driver_frequency_before_vote;
  uint32_t driver_frequency_after_release;
  uint32_t cycle_frequency_before_vote[BDACVAL_CYCLES];
  uint32_t cycle_frequency_active[BDACVAL_CYCLES];
  uint32_t cycle_frequency_after_release[BDACVAL_CYCLES];
  uint32_t driver_dma_isr_cpu_mask;
  uint32_t driver_dma_isr_cpu_count[BK7258_AUD_DIAG_CPU_SLOTS];
  uint32_t driver_dma_isr_min_cycles[BK7258_AUD_DIAG_CPU_SLOTS];
  uint32_t driver_dma_isr_max_cycles[BK7258_AUD_DIAG_CPU_SLOTS];
  uint32_t driver_dma_isr_interval_ticks;
  uint32_t driver_dma_isr_interval_count;
  uint32_t driver_tick_regression_delta;
  uint32_t driver_worker_wake_delta;
  uint32_t driver_worker_cpu_mask;
  uint32_t driver_worker_priority;
  uint32_t driver_sem_backlog_max;
  uint32_t driver_sem_backlog_events_delta;
  uint32_t driver_worker_service_count_delta;
  uint32_t driver_worker_service_max_cycles;
  uint32_t driver_worker_service_max_ticks;
  uint32_t driver_worker_service_cpu_migrations_delta;
  uint32_t driver_worker_isr_during_service_count_delta;
  uint32_t driver_worker_isr_during_service_max;
  uint32_t driver_callback_count_delta;
  uint32_t driver_callback_max_cycles;
  uint32_t driver_callback_max_ticks;
  uint32_t driver_callback_cpu_migrations_delta;
  uint32_t first_underrun_isr_sequence;
  uint32_t first_underrun_worker_wake;
  uint32_t first_underrun_sem_value;
  uint32_t first_underrun_outstanding;
  uint32_t first_underrun_enqueue_count;
  uint32_t first_underrun_dequeue_count;
  uint32_t first_underrun_consume_sequence;
  uint32_t first_underrun_produce_sequence;
  uint32_t first_underrun_cpu;

#ifdef CONFIG_BK7258_AUD_DAC_EQ
  uint32_t eq_pre_reserve_rejects;
  uint32_t eq_invalid_rejects;
  uint32_t eq_runtime_rejects;
  uint32_t expected_eq_config_hash;
  uint32_t driver_eq_shadow_valid;
  uint32_t driver_eq_requested;
  uint32_t driver_eq_applied;
  uint32_t driver_eq_config_delta;
  uint32_t driver_eq_apply_delta;
  uint32_t driver_eq_deconfig_delta;
  uint32_t driver_eq_reject_delta;
  uint32_t driver_eq_readback_delta;
  uint32_t driver_eq_readback_fail_delta;
  uint32_t driver_eq_last_config_hash;
#endif
};

