open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_aud_validation.c
#ifdef CONFIG_BK7258_AUD_DAC_EQ
_Static_assert(sizeof(struct bdacval_diag_s) == 0x1b4,
               "BK7258 AUD EQ validation diagnostic v6 ABI changed");
#else
_Static_assert(sizeof(struct bdacval_diag_s) == 0x17c,
               "BK7258 AUD validation diagnostic v5 ABI changed");
#endif

struct bdacval_cycle_s
{
  struct ap_buffer_s *buffers[BDACVAL_BUFFERS];
  bool                outstanding[BDACVAL_BUFFERS];
  uint32_t            phase;
  uint32_t            dequeues;
  uint32_t            completes;
  uint32_t            submitted;
  int32_t             final_index;
  uint32_t            cycle_number;
  clock_t             start_tick;
  clock_t             last_dequeue_tick;
  clock_t             dequeue_ready_tick;
  bool                dequeue_pending;
  bool                final_enqueued;
  bool                final_dequeued;
};

/****************************************************************************
 * Public Data
 ****************************************************************************/

/* Non-static so a non-halting J-Link read can inspect the result without
 * depending on the console or RPMsg syslog transport.
 */

volatile struct bdacval_diag_s g_bk7258_aud_validation_diag;

static uint64_t g_bdacval_monotonic_max_ns;
static bool g_bdacval_monotonic_valid;

/****************************************************************************
 * Private Functions
 ****************************************************************************/

static int bdacval_errno(void)
{
  return errno > 0 ? -errno : -EIO;
}

#ifdef CONFIG_BK7258_AUD_DAC_EQ

static uint32_t
bdacval_eq_hash(const struct bk7258_aud_eq_config_s *config)
{
  const uint8_t *bytes = (const uint8_t *)config;
  uint32_t hash = 2166136261u;
  unsigned int i;

  for (i = 0; i < sizeof(*config); i++)
    {
      hash ^= bytes[i];
      hash *= 16777619u;
    }

  return hash;
}

static void
bdacval_eq_init_config(struct bk7258_aud_eq_config_s *config,
                       bool boundary_pattern)
{
  static const int32_t pattern[BK7258_AUD_EQ_COEFF_COUNT] =
    {
      BK7258_AUD_EQ_COEFF_MIN,
      BK7258_AUD_EQ_COEFF_MAX,
      -1,
      1,
      0x12345
    };
  unsigned int coefficient;
  unsigned int bank;

  memset(config, 0, sizeof(*config));
  config->version = BK7258_AUD_EQ_CONFIG_VERSION;
  config->size = sizeof(*config);
  config->flags = BK7258_AUD_EQ_FLAG_ENABLE;

  if (boundary_pattern)
    {
      for (bank = 0; bank < BK7258_AUD_EQ_BANK_COUNT; bank++)
        {
          for (coefficient = 0;
               coefficient < BK7258_AUD_EQ_COEFF_COUNT;
               coefficient++)
            {
              config->coeff[bank][coefficient] = pattern[coefficient];
            }
        }
    }
}

static int
bdacval_eq_expect_reject(int fd, unsigned long arg, int expected_errno,
                         volatile uint32_t *counter)
{
  int ret;

  errno = 0;
  ret = ioctl(fd, BK7258_AUDIOIOC_SET_DAC_EQ, arg);
  if (ret >= 0 || errno != expected_errno)
    {
      return -EPROTO;
    }

  (*counter)++;
  return OK;
}

static int bdacval_eq_pre_reserve(int fd)
{
  struct bk7258_aud_eq_config_s config;

  bdacval_eq_init_config(&config, false);
  return bdacval_eq_expect_reject(
    fd, (unsigned long)(uintptr_t)&config, EACCES,
    &g_bk7258_aud_validation_diag.eq_pre_reserve_rejects);
}

static int bdacval_eq_configure_reserved(int fd)
{
  struct bk7258_aud_eq_config_s config;
  struct bk7258_aud_diag_s before;
  struct bk7258_aud_diag_s after;
  uint32_t boundary_hash;
  uint32_t safe_hash;
  int ret;

  ret = bk7258_aud_get_diag(&before);
  if (ret < 0)
    {
      return ret;
    }

  ret = bdacval_eq_expect_reject(
    fd, 0, EINVAL,
    &g_bk7258_aud_validation_diag.eq_invalid_rejects);
  if (ret < 0)
    {
      return ret;
    }

  bdacval_eq_init_config(&config, false);
  config.version++;
  ret = bdacval_eq_expect_reject(
    fd, (unsigned long)(uintptr_t)&config, EINVAL,
    &g_bk7258_aud_validation_diag.eq_invalid_rejects);
  if (ret < 0)
    {
      return ret;
    }

  bdacval_eq_init_config(&config, false);
  config.size -= sizeof(uint32_t);
  ret = bdacval_eq_expect_reject(
    fd, (unsigned long)(uintptr_t)&config, EINVAL,
    &g_bk7258_aud_validation_diag.eq_invalid_rejects);
  if (ret < 0)
    {
      return ret;
    }

  bdacval_eq_init_config(&config, false);
  config.flags |= 1u << 1;
  ret = bdacval_eq_expect_reject(
    fd, (unsigned long)(uintptr_t)&config, EINVAL,
    &g_bk7258_aud_validation_diag.eq_invalid_rejects);
  if (ret < 0)
    {
      return ret;
    }

  bdacval_eq_init_config(&config, false);
  config.coeff[0][0] = BK7258_AUD_EQ_COEFF_MIN - 1;
  ret = bdacval_eq_expect_reject(
    fd, (unsigned long)(uintptr_t)&config, ERANGE,
    &g_bk7258_aud_validation_diag.eq_invalid_rejects);
  if (ret < 0)
    {
      return ret;
    }

  bdacval_eq_init_config(&config, false);
  config.coeff[0][0] = BK7258_AUD_EQ_COEFF_MAX + 1;
  ret = bdacval_eq_expect_reject(
    fd, (unsigned long)(uintptr_t)&config, ERANGE,
    &g_bk7258_aud_validation_diag.eq_invalid_rejects);
  if (ret < 0)
    {
      return ret;
    }

  ret = bk7258_aud_get_diag(&after);
  if (ret < 0)
    {
      return ret;
    }

  if (after.eq_config_count != before.eq_config_count ||
      after.eq_reject_count - before.eq_reject_count != 6 ||
      after.eq_shadow_valid != before.eq_shadow_valid ||
      after.eq_requested != before.eq_requested ||
      after.eq_applied != before.eq_applied ||
      after.eq_last_config_hash != before.eq_last_config_hash ||
      after.eq_readback_count != before.eq_readback_count ||
      after.eq_readback_fail_count != before.eq_readback_fail_count ||
      (after.resources & BK7258_AUD_RESOURCE_EQ) != 0)
    {
      return -EPROTO;
    }

  bdacval_eq_init_config(&config, true);
  boundary_hash = bdacval_eq_hash(&config);
  if (ioctl(fd, BK7258_AUDIOIOC_SET_DAC_EQ,
            (unsigned long)(uintptr_t)&config) < 0)
    {
      return bdacval_errno();
    }

  memset(&config, 0xa5, sizeof(config));
  ret = bk7258_aud_get_diag(&after);
  if (ret < 0)
    {
      return ret;
    }

  if (after.eq_config_count != before.eq_config_count + 1 ||
      after.eq_shadow_valid != 1 || after.eq_requested != 1 ||
      after.eq_applied != 0 ||
      after.eq_last_config_hash != boundary_hash ||
      (after.resources & BK7258_AUD_RESOURCE_EQ) != 0)
    {
      return -EPROTO;
    }

  /* Only the canonical all-zero raw banks reach the running DAC.  This
   * validates enable-bit and zero-bank apply/readback/deconfigure lifecycle
   * without proving nonzero bank packing, Q format, pass-through response or
   * coefficient stability.
   */

  bdacval_eq_init_config(&config, false);
  safe_hash = bdacval_eq_hash(&config);
  if (ioctl(fd, BK7258_AUDIOIOC_SET_DAC_EQ,
            (unsigned long)(uintptr_t)&config) < 0)
    {
      return bdacval_errno();
    }

  g_bk7258_aud_validation_diag.expected_eq_config_hash = safe_hash;
  ret = bk7258_aud_get_diag(&after);
  if (ret < 0)
    {
      return ret;
    }

  if (after.eq_config_count != before.eq_config_count + 2 ||
      after.eq_reject_count - before.eq_reject_count != 6 ||
      after.eq_shadow_valid != 1 || after.eq_requested != 1 ||
      after.eq_applied != 0 || after.eq_last_config_hash != safe_hash ||
      after.eq_readback_count != before.eq_readback_count ||
      after.eq_readback_fail_count != before.eq_readback_fail_count ||
      (after.resources & BK7258_AUD_RESOURCE_EQ) != 0)
    {
      return -EPROTO;
    }

  return OK;
}

static int bdacval_eq_expect_running(int fd)
{
  struct bk7258_aud_eq_config_s config;
  struct bk7258_aud_diag_s diag;
  int ret;

  bdacval_eq_init_config(&config, false);
  ret = bdacval_eq_expect_reject(
    fd, (unsigned long)(uintptr_t)&config, EBUSY,
    &g_bk7258_aud_validation_diag.eq_runtime_rejects);
  if (ret < 0)
    {
      return ret;
    }

