open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_aud_validation.c
  ret = bk7258_aud_get_diag(&diag);
  if (ret < 0)
    {
      return ret;
    }

  if (diag.eq_shadow_valid != 1 || diag.eq_requested != 1 ||
      diag.eq_applied != 1 ||
      diag.eq_last_config_hash !=
        g_bk7258_aud_validation_diag.expected_eq_config_hash ||
      (diag.resources & BK7258_AUD_RESOURCE_EQ) == 0)
    {
      return -EPROTO;
    }

  return OK;
}

#endif /* CONFIG_BK7258_AUD_DAC_EQ */

static void bdacval_sample_monotonic(void)
{
  struct timespec ts;
  uint64_t now;

  if (clock_gettime(CLOCK_MONOTONIC, &ts) < 0 || ts.tv_sec < 0 ||
      ts.tv_nsec < 0 || ts.tv_nsec >= NSEC_PER_SEC)
    {
      g_bk7258_aud_validation_diag.monotonic_sample_errors++;
      return;
    }

  now = (uint64_t)ts.tv_sec * NSEC_PER_SEC + (uint32_t)ts.tv_nsec;
  if (g_bdacval_monotonic_valid && now < g_bdacval_monotonic_max_ns)
    {
      g_bk7258_aud_validation_diag.monotonic_regression_count++;
    }
  else
    {
      g_bdacval_monotonic_max_ns = now;
    }

  g_bdacval_monotonic_valid = true;
}

static uint32_t bdacval_tick_delta(clock_t later, clock_t earlier)
{
  bdacval_sample_monotonic();

  if (later < earlier)
    {
      g_bk7258_aud_validation_diag.tick_regression_count++;
      return 0;
    }

  return (uint32_t)(later - earlier);
}

static void bdacval_set_stage(enum bdacval_stage_e stage)
{
  g_bk7258_aud_validation_diag.stage = stage;
}

static void bdacval_publish_state(uint32_t state)
{
  __asm__ __volatile__("dmb sy" : : : "memory");
  g_bk7258_aud_validation_diag.state = state;
}

static void bdacval_note_cpu(void)
{
  int cpu = sched_getcpu();

  if (cpu >= 0 && cpu < 32)
    {
      g_bk7258_aud_validation_diag.producer_cpu_mask |= 1u << cpu;
    }
}

static void bdacval_deadline(struct timespec *deadline, int seconds)
{
  if (clock_gettime(CLOCK_REALTIME, deadline) < 0)
    {
      memset(deadline, 0, sizeof(*deadline));
    }

  deadline->tv_sec += seconds;
}

static bool bdacval_any_outstanding(const struct bdacval_cycle_s *cycle)
{
  unsigned int i;

  for (i = 0; i < BDACVAL_BUFFERS; i++)
    {
      if (cycle->outstanding[i])
        {
          return true;
        }
    }

  return false;
}

static int bdacval_buffer_index(const struct bdacval_cycle_s *cycle,
                                const struct ap_buffer_s *apb)
{
  unsigned int i;

  for (i = 0; i < BDACVAL_BUFFERS; i++)
    {
      if (cycle->buffers[i] == apb)
        {
          return (int)i;
        }
    }

  return -ENOENT;
}

static void bdacval_fill_tone(struct bdacval_cycle_s *cycle,
                              struct ap_buffer_s *apb, bool final)
{
  int16_t *samples = (int16_t *)apb->samp;
  uint32_t count = apb->nmaxbytes / BK7258_AUD_BYTES_PER_SAMPLE;
  uint32_t sample;

  for (sample = 0; sample < count; sample++)
    {
      samples[sample] = cycle->phase <
                        CONFIG_BK7258_AUD_SAMPLE_RATE / 2u ?
                        BDACVAL_TONE_AMPLITUDE :
                        -BDACVAL_TONE_AMPLITUDE;

      cycle->phase += BDACVAL_TONE_HZ;
      if (cycle->phase >= CONFIG_BK7258_AUD_SAMPLE_RATE)
        {
          cycle->phase -= CONFIG_BK7258_AUD_SAMPLE_RATE;
        }
    }

  apb->curbyte = 0;
  apb->nbytes = apb->nmaxbytes;
  apb->nsamples = count;
  apb->flags &= ~(AUDIO_APB_FINAL | AUDIO_APB_DEQUEUED |
                  AUDIO_APB_OUTPUT_ENQUEUED |
                  AUDIO_APB_OUTPUT_PROCESS);
  if (final)
    {
      apb->flags |= AUDIO_APB_FINAL;
    }
}

static int bdacval_enqueue(int fd, struct bdacval_cycle_s *cycle,
                           unsigned int index, bool final)
{
  struct audio_buf_desc_s desc;
  uint32_t delta;

  bdacval_note_cpu();

  if (index >= BDACVAL_BUFFERS || cycle->buffers[index] == NULL ||
      cycle->outstanding[index])
    {
      return -EINVAL;
    }

  bdacval_fill_tone(cycle, cycle->buffers[index], final);
  memset(&desc, 0, sizeof(desc));
  desc.numbytes = cycle->buffers[index]->nbytes;
  desc.u.buffer = cycle->buffers[index];

  if (ioctl(fd, AUDIOIOC_ENQUEUEBUFFER,
            (unsigned long)(uintptr_t)&desc) < 0)
    {
      return bdacval_errno();
    }

  if (cycle->dequeue_pending)
    {
      delta = bdacval_tick_delta(clock_systime_ticks(),
                                 cycle->dequeue_ready_tick);
      if (delta > g_bk7258_aud_validation_diag
                    .received_dequeue_to_enqueue_max_ticks)
        {
          g_bk7258_aud_validation_diag
            .received_dequeue_to_enqueue_max_ticks = delta;
        }

      cycle->dequeue_pending = false;
    }

  cycle->outstanding[index] = true;
  cycle->submitted++;
  g_bk7258_aud_validation_diag.submitted_buffers++;
  if (final)
    {
      cycle->final_index = (int32_t)index;
      cycle->final_enqueued = true;
      g_bk7258_aud_validation_diag.final_buffers++;
    }

  return OK;
}

static int bdacval_receive(mqd_t mq, struct bdacval_cycle_s *cycle,
                           const struct timespec *deadline,
                           uint16_t *message_id, unsigned int *index)
{
  struct mq_attr attr;
  struct audio_msg_s msg;
  clock_t received_tick;
  uint32_t delta;
  ssize_t received;
  int found;

  for (; ; )
    {
      received = mq_timedreceive(mq, (char *)&msg, sizeof(msg), NULL,
                                 deadline);
      received_tick = clock_systime_ticks();
      if (received < 0)
        {
          if (errno == EINTR)
            {
              continue;
            }

          return bdacval_errno();
        }

      if (received != sizeof(msg))
        {
          return -EPROTO;
        }

      bdacval_note_cpu();
      if (mq_getattr(mq, &attr) == 0 && attr.mq_curmsgs >= 0 &&
          (uint32_t)attr.mq_curmsgs >
          g_bk7258_aud_validation_diag.mq_depth_after_receive_max)
        {
          g_bk7258_aud_validation_diag.mq_depth_after_receive_max =
            (uint32_t)attr.mq_curmsgs;
        }

      *message_id = msg.msg_id;
      *index = UINT32_MAX;

      switch (msg.msg_id)
        {
          case AUDIO_MSG_DEQUEUE:
            if (msg.u.ptr == NULL)
              {
                return -EPROTO;
              }

