open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_aud_validation.c
            found = bdacval_buffer_index(
              cycle, (const struct ap_buffer_s *)msg.u.ptr);
            if (found < 0 || !cycle->outstanding[found])
              {
                return -EPROTO;
              }

            if (cycle->start_tick != 0 && cycle->cycle_number >= 1 &&
                cycle->cycle_number <= BDACVAL_CYCLES)
              {
                if (cycle->last_dequeue_tick == 0)
                  {
                    g_bk7258_aud_validation_diag
                      .first_dequeue_delay_ticks[cycle->cycle_number - 1] =
                      bdacval_tick_delta(received_tick,
                                         cycle->start_tick);
                  }
                else
                  {
                    delta = bdacval_tick_delta(received_tick,
                                               cycle->last_dequeue_tick);
                    if (delta > g_bk7258_aud_validation_diag
                                  .dequeue_interval_max_ticks)
                      {
                        g_bk7258_aud_validation_diag
                          .dequeue_interval_max_ticks = delta;
                      }
                  }
              }

            cycle->last_dequeue_tick = received_tick;
            cycle->dequeue_ready_tick = received_tick;
            cycle->dequeue_pending = true;

            cycle->outstanding[found] = false;
            cycle->dequeues++;
            g_bk7258_aud_validation_diag.dequeues++;
            if (found == cycle->final_index)
              {
                cycle->final_dequeued = true;
              }

            *index = (unsigned int)found;
            return OK;

          case AUDIO_MSG_COMPLETE:
            if (bdacval_any_outstanding(cycle) ||
                (cycle->final_enqueued && !cycle->final_dequeued))
              {
                return -EPROTO;
              }

            cycle->completes++;
            g_bk7258_aud_validation_diag.completes++;
            return OK;

          case AUDIO_MSG_IOERR:
            return msg.u.data == 0 ? -EIO : -(int)msg.u.data;

          case AUDIO_MSG_UNDERRUN:
            return -EPIPE;

          default:
            break;
        }
    }
}

static int bdacval_drain(mqd_t mq, struct bdacval_cycle_s *cycle,
                         uint32_t expected_completes)
{
  struct timespec deadline;
  uint16_t message_id;
  unsigned int index;
  int ret;

  bdacval_deadline(&deadline, BDACVAL_TIMEOUT_SEC);
  while (bdacval_any_outstanding(cycle) ||
         cycle->completes < expected_completes)
    {
      bdacval_set_stage(BDACVAL_STAGE_DRAIN);
      ret = bdacval_receive(mq, cycle, &deadline, &message_id, &index);
      if (ret < 0)
        {
          return ret;
        }
    }

  return cycle->completes == expected_completes ? OK : -EPROTO;
}

static int bdacval_cycle(uint32_t cycle_number)
{
  struct bdacval_cycle_s cycle;
  struct audio_caps_s query;
  struct audio_caps_desc_s caps;
  struct ap_buffer_info_s info;
  struct audio_buf_desc_s desc;
  struct bk7258_aud_diag_s driver_diag;
  struct mq_attr attr;
  struct timespec deadline;
  clock_t start_ioctl_tick;
  clock_t stream_start_tick = 0;
  uint16_t message_id;
  unsigned int index;
  unsigned int i;
  mqd_t mq = (mqd_t)-1;
  bool mq_registered = false;
  bool reserved = false;
  bool cleanup_required = false;
  bool clean = false;
  int fd = -1;
  int ret = OK;
  int cleanup_ret;

  memset(&cycle, 0, sizeof(cycle));
  cycle.final_index = -1;
  cycle.cycle_number = cycle_number;

  bdacval_set_stage(BDACVAL_STAGE_OPEN);
  fd = open(BDACVAL_DEVPATH, O_RDWR | O_CLOEXEC);
  if (fd < 0)
    {
      ret = bdacval_errno();
      goto out;
    }

  memset(&query, 0, sizeof(query));
  query.ac_len = sizeof(query);
  query.ac_type = AUDIO_TYPE_QUERY;
  query.ac_subtype = AUDIO_TYPE_QUERY;
  bdacval_set_stage(BDACVAL_STAGE_CAPS);
  if (ioctl(fd, AUDIOIOC_GETCAPS,
            (unsigned long)(uintptr_t)&query) < 0)
    {
      ret = bdacval_errno();
      goto out;
    }

  if ((query.ac_controls.b[0] & AUDIO_TYPE_OUTPUT) == 0 ||
      (query.ac_format.hw & (1 << (AUDIO_FMT_PCM - 1))) == 0)
    {
      ret = -EPROTO;
      goto out;
    }

#ifdef CONFIG_BK7258_AUD_DAC_EQ
  bdacval_set_stage(BDACVAL_STAGE_EQ_CONFIG);
  ret = bdacval_eq_pre_reserve(fd);
  if (ret < 0)
    {
      goto out;
    }
#endif

  bdacval_set_stage(BDACVAL_STAGE_RESERVE);
  cleanup_required = true;
  bdacval_sample_monotonic();
  if (ioctl(fd, AUDIOIOC_RESERVE, 0) < 0)
    {
      ret = bdacval_errno();
      goto out;
    }

  bdacval_sample_monotonic();

  reserved = true;
#ifdef CONFIG_BK7258_AUD_DAC_EQ
  bdacval_set_stage(BDACVAL_STAGE_EQ_CONFIG);
  ret = bdacval_eq_configure_reserved(fd);
  if (ret < 0)
    {
      goto out;
    }
#endif

  memset(&caps, 0, sizeof(caps));
  caps.caps.ac_len = sizeof(caps.caps);
  caps.caps.ac_type = AUDIO_TYPE_OUTPUT;
  caps.caps.ac_subtype = AUDIO_FMT_PCM;
  caps.caps.ac_channels = 1;
  caps.caps.ac_controls.hw[0] = CONFIG_BK7258_AUD_SAMPLE_RATE;
  caps.caps.ac_controls.b[3] =
    CONFIG_BK7258_AUD_SAMPLE_RATE >> 16;
  caps.caps.ac_controls.b[2] = BK7258_AUD_BITS_PER_SAMPLE;

  bdacval_set_stage(BDACVAL_STAGE_CONFIGURE);
  if (ioctl(fd, AUDIOIOC_CONFIGURE,
            (unsigned long)(uintptr_t)&caps) < 0)
    {
      ret = bdacval_errno();
      goto out;
    }

  memset(&info, 0, sizeof(info));
  bdacval_set_stage(BDACVAL_STAGE_BUFFER_INFO);
  if (ioctl(fd, AUDIOIOC_GETBUFFERINFO,
            (unsigned long)(uintptr_t)&info) < 0)
    {
      ret = bdacval_errno();
      goto out;
    }

  if (info.nbuffers != BDACVAL_BUFFERS ||
      info.buffer_size != CONFIG_BK7258_AUD_FRAME_SAMPLES *
                          BK7258_AUD_BYTES_PER_SAMPLE)
    {
      ret = -EPROTO;
      goto out;
    }

  memset(&attr, 0, sizeof(attr));
  attr.mq_maxmsg = info.nbuffers + 8;
  attr.mq_msgsize = sizeof(struct audio_msg_s);
  (void)mq_unlink(BDACVAL_MQNAME);

  bdacval_set_stage(BDACVAL_STAGE_MESSAGE_QUEUE);
  mq = mq_open(BDACVAL_MQNAME, O_RDWR | O_CREAT, 0644, &attr);
  if (mq == (mqd_t)-1)
    {
      ret = bdacval_errno();
      goto out;
    }

  if (ioctl(fd, AUDIOIOC_REGISTERMQ, (unsigned long)mq) < 0)
    {
      ret = bdacval_errno();
      goto out;
    }

  mq_registered = true;
  bdacval_set_stage(BDACVAL_STAGE_ALLOCATE);

  for (i = 0; i < BDACVAL_BUFFERS; i++)
    {
      memset(&desc, 0, sizeof(desc));
      desc.numbytes = info.buffer_size;
      desc.u.pbuffer = &cycle.buffers[i];
      if (ioctl(fd, AUDIOIOC_ALLOCBUFFER,
                (unsigned long)(uintptr_t)&desc) < 0 ||
          cycle.buffers[i] == NULL)
        {
          ret = cycle.buffers[i] == NULL ? -ENOMEM : bdacval_errno();
          goto out;
        }
    }

  bdacval_set_stage(BDACVAL_STAGE_PRIME);
  for (i = 0; i < BDACVAL_BUFFERS; i++)
    {
      ret = bdacval_enqueue(fd, &cycle, i, false);
      if (ret < 0)
        {
          goto out;
        }
    }

