open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_aud_validation.c
  bdacval_set_stage(BDACVAL_STAGE_START);
  bdacval_sample_monotonic();
  start_ioctl_tick = clock_systime_ticks();
  if (ioctl(fd, AUDIOIOC_START, 0) < 0)
    {
      ret = bdacval_errno();
      goto out;
    }

  stream_start_tick = clock_systime_ticks();
  bdacval_sample_monotonic();
  cycle.start_tick = stream_start_tick;
  if (cycle_number >= 1 && cycle_number <= BDACVAL_CYCLES)
    {
      g_bk7258_aud_validation_diag.start_ioctl_ticks[cycle_number - 1] =
        bdacval_tick_delta(stream_start_tick, start_ioctl_tick);
    }

#ifdef CONFIG_BK7258_AUD_DAC_EQ
  bdacval_set_stage(BDACVAL_STAGE_EQ_CONFIG);
  ret = bdacval_eq_expect_running(fd);
  if (ret < 0)
    {
      goto out;
    }
#endif

  bdacval_deadline(&deadline, BDACVAL_TIMEOUT_SEC);

  for (; ; )
    {
      bdacval_set_stage(BDACVAL_STAGE_RECEIVE);
      ret = bdacval_receive(mq, &cycle, &deadline, &message_id, &index);
      if (ret < 0)
        {
          goto out;
        }

      if (message_id == AUDIO_MSG_COMPLETE)
        {
          if (cycle_number != 2 || !cycle.final_enqueued ||
              !cycle.final_dequeued || bdacval_any_outstanding(&cycle))
            {
              ret = -EPROTO;
              goto out;
            }

          break;
        }

      if (message_id != AUDIO_MSG_DEQUEUE)
        {
          continue;
        }

      if (cycle_number == 1 &&
          cycle.dequeues >= BDACVAL_TARGET_DEQUEUES)
        {
          bdacval_set_stage(BDACVAL_STAGE_STOP);
          if (ioctl(fd, AUDIOIOC_STOP, 0) < 0)
            {
              ret = bdacval_errno();
              goto out;
            }

          g_bk7258_aud_validation_diag.manual_stop_cycles++;
          ret = bdacval_drain(mq, &cycle, 1);
          if (ret < 0)
            {
              goto out;
            }

          break;
        }

      if (cycle_number == 2 &&
          cycle.dequeues >= BDACVAL_TARGET_DEQUEUES &&
          !cycle.final_enqueued)
        {
          ret = bdacval_enqueue(fd, &cycle, index, true);
          if (ret < 0)
            {
              goto out;
            }

          continue;
        }

      if (!cycle.final_enqueued)
        {
          ret = bdacval_enqueue(fd, &cycle, index, false);
          if (ret < 0)
            {
              goto out;
            }
        }
    }

  if (cycle_number == 2)
    {
      ret = bdacval_drain(mq, &cycle, 1);
      if (ret < 0)
        {
          goto out;
        }

      g_bk7258_aud_validation_diag.natural_drain_cycles++;
    }

  if (bdacval_any_outstanding(&cycle))
    {
      ret = -EBUSY;
      goto out;
    }

  if (cycle_number >= 1 && cycle_number <= BDACVAL_CYCLES)
    {
      g_bk7258_aud_validation_diag.cycle_ticks[cycle_number - 1] =
        bdacval_tick_delta(clock_systime_ticks(), stream_start_tick);
    }

  bdacval_set_stage(BDACVAL_STAGE_RELEASE);
  bdacval_sample_monotonic();
  if (ioctl(fd, AUDIOIOC_RELEASE, 0) < 0)
    {
      ret = bdacval_errno();
      goto out;
    }

  reserved = false;
  cleanup_required = false;
  bdacval_sample_monotonic();

  /* Preserve each session's complete DVFS transition rather than relying
   * only on the final overwritten driver snapshot.
   */

  ret = bk7258_aud_get_diag(&driver_diag);
  if (ret < 0)
    {
      goto out;
    }

  if (cycle_number < 1 || cycle_number > BDACVAL_CYCLES)
    {
      ret = -ERANGE;
      goto out;
    }

  g_bk7258_aud_validation_diag
    .cycle_frequency_before_vote[cycle_number - 1] =
    driver_diag.frequency_before_vote;
  g_bk7258_aud_validation_diag
    .cycle_frequency_active[cycle_number - 1] =
    driver_diag.perf_frequency;
  g_bk7258_aud_validation_diag
    .cycle_frequency_after_release[cycle_number - 1] =
    driver_diag.frequency_after_release;

  if (driver_diag.frequency_before_vote != BDACVAL_IDLE_CPU_HZ ||
      driver_diag.perf_frequency != BDACVAL_ACTIVE_CPU_HZ ||
      driver_diag.frequency_after_release != BDACVAL_IDLE_CPU_HZ)
    {
      ret = -EPROTO;
      goto out;
    }

#ifdef CONFIG_BK7258_AUD_DAC_EQ
  if (driver_diag.eq_shadow_valid != 0 ||
      driver_diag.eq_requested != 0 || driver_diag.eq_applied != 0 ||
      (driver_diag.resources & BK7258_AUD_RESOURCE_EQ) != 0)
    {
      ret = -EPROTO;
      goto out;
    }
#endif

  if (ioctl(fd, AUDIOIOC_UNREGISTERMQ, (unsigned long)mq) < 0)
    {
      ret = bdacval_errno();
      goto out;
    }

  mq_registered = false;
  clean = true;
  g_bk7258_aud_validation_diag.cycles = cycle_number;

out:
  /* On an error, explicit SHUTDOWN runs while the MQ is still registered.
   * It synchronously quiesces the worker and produces every required
   * DEQUEUE before the APBs can be freed.
   */

  if (!clean && fd >= 0 && cleanup_required)
    {
      cleanup_ret = ioctl(fd, AUDIOIOC_SHUTDOWN, 0);
      if (cleanup_ret < 0 && ret == OK)
        {
          ret = bdacval_errno();
        }
      else if (cleanup_ret >= 0)
        {
          reserved = false;
          cleanup_required = false;
        }

      if (mq_registered)
        {
          struct timespec cleanup_deadline;

          bdacval_deadline(&cleanup_deadline, BDACVAL_TIMEOUT_SEC);
          while (bdacval_any_outstanding(&cycle))
            {
              cleanup_ret = bdacval_receive(mq, &cycle,
                                            &cleanup_deadline,
                                            &message_id, &index);
              if (cleanup_ret < 0)
                {
                  if (ret == OK)
                    {
                      ret = cleanup_ret;
                    }

                  break;
                }
            }
        }
    }

  if (fd >= 0 && !bdacval_any_outstanding(&cycle))
    {
      if (reserved)
        {
          cleanup_ret = ioctl(fd, AUDIOIOC_RELEASE, 0);
          if (cleanup_ret < 0 && ret == OK)
            {
              ret = bdacval_errno();
            }
          else if (cleanup_ret >= 0)
            {
              reserved = false;
              cleanup_required = false;
            }
        }

      if (!reserved && !cleanup_required && mq_registered)
        {
          cleanup_ret = ioctl(fd, AUDIOIOC_UNREGISTERMQ,
                              (unsigned long)mq);
          if (cleanup_ret < 0 && ret == OK)
            {
              ret = bdacval_errno();
            }
          else if (cleanup_ret >= 0)
            {
              mq_registered = false;
            }
        }

      if (!reserved && !cleanup_required && !mq_registered)
        {
          for (i = 0; i < BDACVAL_BUFFERS; i++)
            {
              if (cycle.buffers[i] != NULL)
                {
                  memset(&desc, 0, sizeof(desc));
                  desc.u.buffer = cycle.buffers[i];
                  cleanup_ret = ioctl(fd, AUDIOIOC_FREEBUFFER,
                                      (unsigned long)(uintptr_t)&desc);
                  if (cleanup_ret < 0 && ret == OK)
                    {
                      ret = bdacval_errno();
                    }

