open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_aud_validation.c
                  cycle.buffers[i] = NULL;
                }
            }

          cleanup_ret = close(fd);
          if (cleanup_ret < 0 && ret == OK)
            {
              ret = bdacval_errno();
            }

          fd = -1;
        }
    }

  if (mq != (mqd_t)-1 && !mq_registered)
    {
      mq_close(mq);
      (void)mq_unlink(BDACVAL_MQNAME);
    }

  return ret;
}

static void bdacval_publish_driver_delta(
  const struct bk7258_aud_diag_s *before,
  const struct bk7258_aud_diag_s *after)
{
  g_bk7258_aud_validation_diag.driver_state = after->state;
  g_bk7258_aud_validation_diag.driver_first_error = after->first_error;
  g_bk7258_aud_validation_diag.driver_resources = after->resources;
  g_bk7258_aud_validation_diag.driver_enqueue_delta =
    after->enqueue_count - before->enqueue_count;
  g_bk7258_aud_validation_diag.driver_dequeue_delta =
    after->dequeue_count - before->dequeue_count;
  g_bk7258_aud_validation_diag.driver_complete_delta =
    after->complete_count - before->complete_count;
  g_bk7258_aud_validation_diag.driver_submitted_delta =
    after->submitted_bytes - before->submitted_bytes;
  g_bk7258_aud_validation_diag.driver_played_delta =
    after->played_bytes - before->played_bytes;
  g_bk7258_aud_validation_diag.driver_dma_alloc_delta =
    after->dma_alloc_count - before->dma_alloc_count;
  g_bk7258_aud_validation_diag.driver_dma_start_delta =
    after->dma_start_count - before->dma_start_count;
  g_bk7258_aud_validation_diag.driver_dma_isr_delta =
    after->dma_isr_count - before->dma_isr_count;
  g_bk7258_aud_validation_diag.driver_final_drain_delta =
    after->final_drain_count - before->final_drain_count;
  g_bk7258_aud_validation_diag.driver_dma_stop_delta =
    after->dma_stop_count - before->dma_stop_count;
  g_bk7258_aud_validation_diag.driver_dma_deinit_delta =
    after->dma_deinit_count - before->dma_deinit_count;
  g_bk7258_aud_validation_diag.driver_dma_free_delta =
    after->dma_free_count - before->dma_free_count;
  g_bk7258_aud_validation_diag.driver_dac_start_delta =
    after->dac_start_count - before->dac_start_count;
  g_bk7258_aud_validation_diag.driver_dac_stop_delta =
    after->dac_stop_count - before->dac_stop_count;
  g_bk7258_aud_validation_diag.driver_pa_on_delta =
    after->pa_on_count - before->pa_on_count;
  g_bk7258_aud_validation_diag.driver_pa_off_delta =
    after->pa_off_count - before->pa_off_count;
  g_bk7258_aud_validation_diag.driver_underrun_delta =
    after->underrun_count - before->underrun_count;
  g_bk7258_aud_validation_diag.driver_pa_enabled = after->pa_enabled;
  g_bk7258_aud_validation_diag.driver_perf_before_frequency =
    before->perf_frequency;
  g_bk7258_aud_validation_diag.driver_perf_frequency =
    after->perf_frequency;
  g_bk7258_aud_validation_diag.driver_frequency_vote_delta =
    after->frequency_vote_count - before->frequency_vote_count;
  g_bk7258_aud_validation_diag.driver_frequency_release_delta =
    after->frequency_release_count - before->frequency_release_count;
  g_bk7258_aud_validation_diag.driver_frequency_before_vote =
    after->frequency_before_vote;
  g_bk7258_aud_validation_diag.driver_frequency_after_release =
    after->frequency_after_release;
  g_bk7258_aud_validation_diag.driver_dma_isr_cpu_mask =
    after->dma_isr_cpu_mask;
  g_bk7258_aud_validation_diag.driver_dma_isr_cpu_count[0] =
    after->dma_isr_cpu_count[0] - before->dma_isr_cpu_count[0];
  g_bk7258_aud_validation_diag.driver_dma_isr_cpu_count[1] =
    after->dma_isr_cpu_count[1] - before->dma_isr_cpu_count[1];
  g_bk7258_aud_validation_diag.driver_dma_isr_min_cycles[0] =
    after->dma_isr_min_cycles[0];
  g_bk7258_aud_validation_diag.driver_dma_isr_min_cycles[1] =
    after->dma_isr_min_cycles[1];
  g_bk7258_aud_validation_diag.driver_dma_isr_max_cycles[0] =
    after->dma_isr_max_cycles[0];
  g_bk7258_aud_validation_diag.driver_dma_isr_max_cycles[1] =
    after->dma_isr_max_cycles[1];
  g_bk7258_aud_validation_diag.driver_dma_isr_interval_ticks =
    after->dma_isr_interval_ticks - before->dma_isr_interval_ticks;
  g_bk7258_aud_validation_diag.driver_dma_isr_interval_count =
    after->dma_isr_interval_count - before->dma_isr_interval_count;
  g_bk7258_aud_validation_diag.driver_tick_regression_delta =
    after->tick_regression_count - before->tick_regression_count;
  g_bk7258_aud_validation_diag.driver_worker_wake_delta =
    after->worker_wake_count - before->worker_wake_count;
  g_bk7258_aud_validation_diag.driver_worker_cpu_mask =
    after->worker_cpu_mask;
  g_bk7258_aud_validation_diag.driver_worker_priority =
    after->worker_priority;
  g_bk7258_aud_validation_diag.driver_sem_backlog_max =
    after->sem_backlog_max;
  g_bk7258_aud_validation_diag.driver_sem_backlog_events_delta =
    after->sem_backlog_events - before->sem_backlog_events;
  g_bk7258_aud_validation_diag.driver_worker_service_count_delta =
    after->worker_service_count - before->worker_service_count;
  g_bk7258_aud_validation_diag.driver_worker_service_max_cycles =
    after->worker_service_max_cycles;
  g_bk7258_aud_validation_diag.driver_worker_service_max_ticks =
    after->worker_service_max_ticks;
  g_bk7258_aud_validation_diag
    .driver_worker_service_cpu_migrations_delta =
    after->worker_service_cpu_migrations -
    before->worker_service_cpu_migrations;
  g_bk7258_aud_validation_diag
    .driver_worker_isr_during_service_count_delta =
    after->worker_isr_during_service_count -
    before->worker_isr_during_service_count;
  g_bk7258_aud_validation_diag.driver_worker_isr_during_service_max =
    after->worker_isr_during_service_max;
  g_bk7258_aud_validation_diag.driver_callback_count_delta =
    after->dequeue_callback_count - before->dequeue_callback_count;
  g_bk7258_aud_validation_diag.driver_callback_max_cycles =
    after->dequeue_callback_max_cycles;
  g_bk7258_aud_validation_diag.driver_callback_max_ticks =
    after->dequeue_callback_max_ticks;
  g_bk7258_aud_validation_diag.driver_callback_cpu_migrations_delta =
    after->dequeue_callback_cpu_migrations -
    before->dequeue_callback_cpu_migrations;
  g_bk7258_aud_validation_diag.first_underrun_isr_sequence =
    after->first_underrun_isr_sequence;
  g_bk7258_aud_validation_diag.first_underrun_worker_wake =
    after->first_underrun_worker_wake;
  g_bk7258_aud_validation_diag.first_underrun_sem_value =
    after->first_underrun_sem_value;
  g_bk7258_aud_validation_diag.first_underrun_outstanding =
    after->first_underrun_outstanding;
  g_bk7258_aud_validation_diag.first_underrun_enqueue_count =
    after->first_underrun_enqueue_count;
  g_bk7258_aud_validation_diag.first_underrun_dequeue_count =
    after->first_underrun_dequeue_count;
  g_bk7258_aud_validation_diag.first_underrun_consume_sequence =
    after->first_underrun_consume_sequence;
  g_bk7258_aud_validation_diag.first_underrun_produce_sequence =
    after->first_underrun_produce_sequence;
  g_bk7258_aud_validation_diag.first_underrun_cpu =
    after->first_underrun_cpu;
#ifdef CONFIG_BK7258_AUD_DAC_EQ
  g_bk7258_aud_validation_diag.driver_eq_shadow_valid =
    after->eq_shadow_valid;
  g_bk7258_aud_validation_diag.driver_eq_requested =
    after->eq_requested;
  g_bk7258_aud_validation_diag.driver_eq_applied =
    after->eq_applied;
  g_bk7258_aud_validation_diag.driver_eq_config_delta =
    after->eq_config_count - before->eq_config_count;
  g_bk7258_aud_validation_diag.driver_eq_apply_delta =
    after->eq_apply_count - before->eq_apply_count;
  g_bk7258_aud_validation_diag.driver_eq_deconfig_delta =
    after->eq_deconfig_count - before->eq_deconfig_count;
  g_bk7258_aud_validation_diag.driver_eq_reject_delta =
    after->eq_reject_count - before->eq_reject_count;
  g_bk7258_aud_validation_diag.driver_eq_readback_delta =
    after->eq_readback_count - before->eq_readback_count;
  g_bk7258_aud_validation_diag.driver_eq_readback_fail_delta =
    after->eq_readback_fail_count - before->eq_readback_fail_count;
  g_bk7258_aud_validation_diag.driver_eq_last_config_hash =
    after->eq_last_config_hash;
#endif
}

