open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_aud_validation.c
static int bdacval_check_driver(
  const struct bk7258_aud_diag_s *before,
  const struct bk7258_aud_diag_s *after)
{
  bdacval_publish_driver_delta(before, after);

  if (after->magic != BK7258_AUD_DIAG_MAGIC ||
      after->version != BK7258_AUD_DIAG_VERSION ||
      after->size != sizeof(*after) ||
      after->state != BK7258_AUD_DIAG_RESET ||
      after->first_error != 0 || after->resources != 0 ||
      after->pa_enabled != 0 ||
      before->perf_frequency != BDACVAL_IDLE_CPU_HZ ||
      after->perf_frequency != BDACVAL_ACTIVE_CPU_HZ ||
      after->frequency_before_vote != BDACVAL_IDLE_CPU_HZ ||
      after->frequency_after_release != BDACVAL_IDLE_CPU_HZ)
    {
      return -EPROTO;
    }

#ifdef CONFIG_BK7258_AUD_DAC_EQ
  if (after->eq_shadow_valid != 0 || after->eq_requested != 0 ||
      after->eq_applied != 0 ||
      (after->resources & BK7258_AUD_RESOURCE_EQ) != 0 ||
      after->eq_last_config_hash !=
        g_bk7258_aud_validation_diag.expected_eq_config_hash)
    {
      return -EPROTO;
    }
#endif

  if (g_bk7258_aud_validation_diag.driver_enqueue_delta == 0 ||
      g_bk7258_aud_validation_diag.driver_enqueue_delta !=
      g_bk7258_aud_validation_diag.driver_dequeue_delta ||
      g_bk7258_aud_validation_diag.driver_complete_delta !=
      BDACVAL_CYCLES ||
      g_bk7258_aud_validation_diag.driver_submitted_delta == 0 ||
      g_bk7258_aud_validation_diag.driver_played_delta == 0 ||
      g_bk7258_aud_validation_diag.driver_played_delta >
      g_bk7258_aud_validation_diag.driver_submitted_delta)
    {
      return -EPROTO;
    }

  if (g_bk7258_aud_validation_diag.driver_dma_alloc_delta !=
      BDACVAL_CYCLES ||
      g_bk7258_aud_validation_diag.driver_dma_start_delta !=
      BDACVAL_CYCLES ||
      g_bk7258_aud_validation_diag.driver_dma_isr_delta == 0 ||
      g_bk7258_aud_validation_diag.driver_final_drain_delta !=
      BK7258_AUD_FINAL_DRAIN_FRAMES ||
      g_bk7258_aud_validation_diag.driver_dma_stop_delta !=
      BDACVAL_CYCLES ||
      g_bk7258_aud_validation_diag.driver_dma_deinit_delta !=
      BDACVAL_CYCLES ||
      g_bk7258_aud_validation_diag.driver_dma_free_delta !=
      BDACVAL_CYCLES ||
      g_bk7258_aud_validation_diag.driver_dac_start_delta !=
      BDACVAL_CYCLES ||
      g_bk7258_aud_validation_diag.driver_dac_stop_delta !=
      BDACVAL_CYCLES ||
      g_bk7258_aud_validation_diag.driver_pa_on_delta !=
      BDACVAL_CYCLES ||
      g_bk7258_aud_validation_diag.driver_pa_off_delta !=
      BDACVAL_CYCLES ||
      g_bk7258_aud_validation_diag.driver_frequency_vote_delta !=
      BDACVAL_CYCLES ||
      g_bk7258_aud_validation_diag.driver_frequency_release_delta !=
      BDACVAL_CYCLES ||
      g_bk7258_aud_validation_diag.driver_worker_priority !=
      CONFIG_BK7258_AUD_WORKER_PRIORITY ||
      g_bk7258_aud_validation_diag.producer_priority <=
      g_bk7258_aud_validation_diag.driver_worker_priority ||
      g_bk7258_aud_validation_diag.driver_underrun_delta != 0 ||
      g_bk7258_aud_validation_diag.driver_tick_regression_delta != 0 ||
      g_bk7258_aud_validation_diag.tick_regression_count != 0 ||
      g_bk7258_aud_validation_diag.monotonic_regression_count != 0 ||
      g_bk7258_aud_validation_diag.monotonic_sample_errors != 0)
    {
      return -EPROTO;
    }

#ifdef CONFIG_BK7258_AUD_DAC_EQ
  if (g_bk7258_aud_validation_diag.eq_pre_reserve_rejects !=
        BDACVAL_CYCLES ||
      g_bk7258_aud_validation_diag.eq_invalid_rejects !=
        6u * BDACVAL_CYCLES ||
      g_bk7258_aud_validation_diag.eq_runtime_rejects !=
        BDACVAL_CYCLES ||
      g_bk7258_aud_validation_diag.driver_eq_config_delta !=
        BDACVAL_EQ_CONFIGS_PER_CYCLE * BDACVAL_CYCLES ||
      g_bk7258_aud_validation_diag.driver_eq_apply_delta !=
        BDACVAL_CYCLES ||
      g_bk7258_aud_validation_diag.driver_eq_deconfig_delta !=
        BDACVAL_CYCLES ||
      g_bk7258_aud_validation_diag.driver_eq_reject_delta !=
        BDACVAL_EQ_REJECTS_PER_CYCLE * BDACVAL_CYCLES ||
      g_bk7258_aud_validation_diag.driver_eq_readback_delta !=
        BDACVAL_EQ_READBACKS_PER_CYCLE * BDACVAL_CYCLES ||
      g_bk7258_aud_validation_diag.driver_eq_readback_fail_delta != 0 ||
      g_bk7258_aud_validation_diag.driver_eq_shadow_valid != 0 ||
      g_bk7258_aud_validation_diag.driver_eq_requested != 0 ||
      g_bk7258_aud_validation_diag.driver_eq_applied != 0 ||
      g_bk7258_aud_validation_diag.driver_eq_last_config_hash !=
        g_bk7258_aud_validation_diag.expected_eq_config_hash)
    {
      return -EPROTO;
    }
#endif

  return OK;
}

static int bdacval_thread(int argc, char **argv)
{
  struct sched_param param;
  struct bk7258_aud_diag_s before;
  struct bk7258_aud_diag_s after;
  uint32_t cycle;
  bool before_valid = false;
  bool driver_published = false;
  int diag_ret;
  int ret;

  (void)argc;
  (void)argv;

  memset((void *)&g_bk7258_aud_validation_diag, 0,
         sizeof(g_bk7258_aud_validation_diag));
  g_bdacval_monotonic_max_ns = 0;
  g_bdacval_monotonic_valid = false;
  g_bk7258_aud_validation_diag.magic = BDACVAL_MAGIC;
  g_bk7258_aud_validation_diag.version = BDACVAL_VERSION;
  g_bk7258_aud_validation_diag.size =
    sizeof(g_bk7258_aud_validation_diag);
  g_bk7258_aud_validation_diag.stage = BDACVAL_STAGE_INIT;
  g_bk7258_aud_validation_diag.tick_frequency = CLK_TCK;
  memset(&param, 0, sizeof(param));
  if (sched_getparam(0, &param) == 0)
    {
      g_bk7258_aud_validation_diag.producer_priority =
        (uint32_t)param.sched_priority;
    }

  bdacval_note_cpu();
  bdacval_sample_monotonic();
  bdacval_publish_state(BDACVAL_RUNNING);

  usleep(BDACVAL_START_DELAY_US);
  ret = bk7258_aud_get_diag(&before);
  if (ret < 0)
    {
      goto done;
    }

  before_valid = true;

  for (cycle = 1; cycle <= BDACVAL_CYCLES; cycle++)
    {
      ret = bdacval_cycle(cycle);
      if (ret < 0)
        {
          goto done;
        }

      syslog(LOG_INFO, "BDACVAL cycle=%" PRIu32 "/%u PASS mode=%s\n",
             cycle, BDACVAL_CYCLES,
             cycle == 1 ? "stop" : "final");
    }

