open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_aud_validation.c
  bdacval_set_stage(BDACVAL_STAGE_DIAGNOSTIC);
  ret = bk7258_aud_get_diag(&after);
  if (ret < 0)
    {
      goto done;
    }

  ret = bdacval_check_driver(&before, &after);
  driver_published = true;

done:
  /* A failed lifecycle cycle has already completed its synchronous cleanup.
   * Publish the remaining driver state before the terminal validation state
   * even when execution never reached the normal diagnostic stage.
   */

  if (before_valid && !driver_published)
    {
      diag_ret = bk7258_aud_get_diag(&after);
      if (diag_ret == OK)
        {
          bdacval_publish_driver_delta(&before, &after);
        }
      else if (ret == OK)
        {
          ret = diag_ret;
        }
    }

  g_bk7258_aud_validation_diag.result = ret;
  if (ret == OK)
    {
      syslog(LOG_INFO,
             "BDACVAL PASS cycles=%u buffers=%" PRIu32
             " dma_isr=%" PRIu32 " played=%" PRIu32
             " pa=%" PRIu32 "/%" PRIu32 "\n",
             BDACVAL_CYCLES,
             g_bk7258_aud_validation_diag.driver_enqueue_delta,
             g_bk7258_aud_validation_diag.driver_dma_isr_delta,
             g_bk7258_aud_validation_diag.driver_played_delta,
             g_bk7258_aud_validation_diag.driver_pa_on_delta,
             g_bk7258_aud_validation_diag.driver_pa_off_delta);
      bdacval_publish_state(BDACVAL_PASSED);
    }
  else
    {
      syslog(LOG_ERR,
             "BDACVAL FAIL stage=%" PRIu32 " cycle=%" PRIu32
             " ret=%d resources=0x%08" PRIx32 "\n",
             g_bk7258_aud_validation_diag.stage,
             g_bk7258_aud_validation_diag.cycles, ret,
             g_bk7258_aud_validation_diag.driver_resources);
      bdacval_publish_state(BDACVAL_FAILED);
    }

  return 0;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

int bk7258_aud_validation_start(void)
{
  int priority;
  int ret;

  /* Match the bounded feeder priority used by the standard NuttX nxplayer
   * and nxlooper clients.  The lower-half refills a completed DMA slot before
   * publishing DEQUEUE, then runs one level below this producer so the newly
   * woken feeder can return one buffer before another DMA token forms a
   * continuous worker chain.  The selected profile verifies the complete
   * producer > worker > transport ordering at runtime.
   */

  priority = sched_get_priority_max(SCHED_FIFO) - 9;
  ret = kthread_create("bdac-validate", priority,
                       BDACVAL_STACKSIZE, bdacval_thread, NULL);
  if (ret < 0)
    {
      memset((void *)&g_bk7258_aud_validation_diag, 0,
             sizeof(g_bk7258_aud_validation_diag));
      g_bk7258_aud_validation_diag.magic = BDACVAL_MAGIC;
      g_bk7258_aud_validation_diag.version = BDACVAL_VERSION;
      g_bk7258_aud_validation_diag.size =
        sizeof(g_bk7258_aud_validation_diag);
      g_bk7258_aud_validation_diag.result = ret;
      g_bk7258_aud_validation_diag.stage = BDACVAL_STAGE_INIT;
      bdacval_publish_state(BDACVAL_FAILED);
      return ret;
    }

  return OK;
}

#endif /* CONFIG_BK7258_AUD_LIFECYCLE_VALIDATION */
